ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
    public function admin_index()
 {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->like('judul', $q)->paginate(5), # data dibatasi 10 record per halaman

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`) VALUES ('Malin Kundang', 'Malin Kundang (Anak Durhaka) adalah sebuah film tahun 1971 yang disutradarai D. Djajakusuma dan diadaptasikan oleh Asrul Sani dari cerita rakyat berjudul serupa. Film ini mengisahkan seorang pemuda yang lupa daratan setelah menghabiskan masa kecilnya di lautan.', 'Malin-Kundang', '1200x600-pantai-air-manis-tempat-malin-kundang-dikutuk-sang-ibu-150826f (1).jpg')
---
    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();
        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');
            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'gambar' => $file->getName(),
            ]);